# 3. Задайте последовательность чисел. 
# Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

numbers = {2, 7, 5, 8, 4, 5, 3, 1} 

print(set(numbers))